# Используем официальный образ Python 3.11 в качестве базового.
# Это минималистичный образ (Alpine), который уменьшает размер итогового образа.
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера.
# Все последующие команды будут выполняться внутри /app.
WORKDIR /app

# Копируем файл зависимостей в рабочую директорию.
# Это позволяет Docker кэшировать установку пакетов, что ускоряет сборку.
COPY requirements.txt .

# Устанавливаем зависимости из requirements.txt.
# Используем --no-cache-dir, чтобы не хранить временные файлы.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь исходный код приложения в контейнер.
# Точка . означает "текущая директория".
# .dockerignore позволяет исключить ненужные файлы при копировании.
COPY . .

# Команда для запуска Uvicorn-сервера, когда контейнер будет запущен.
# BIND 0.0.0.0 позволяет контейнеру быть доступным извне.
# --reload здесь убран, так как он используется только для разработки.
# src.main:app - указывает на модуль src/main.py и экземпляр app внутри него.
CMD ["uvicorn", "src.main:app", "--host", "0.0.0.0", "--port", "8000"]
